{
  "backend/main.mo": "Motoko canister defining product, contact, and document types with query and update functions for retrieval and submission, plus static business info fields and blob-storage mixin.",
  "feature_evidence.json": "Report documenting a feature to make the custom domain canonical and listing affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and functionality of all key frontend files and components.",
  "frontend/DOMAIN_CONNECTION_INSTRUCTIONS.md": "Guide explaining how to configure pccomputerandcommunication.com as the primary domain for the IC app with DNS and verification steps.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables for light and dark themes and applying global background and text styling.",
  "frontend/index.html": "HTML entry file with canonical link set to https://pccomputerandcommunication.com and script loading the React app.",
  "frontend/public/.well-known/ic-domains": "Domain verification file listing pccomputerandcommunication.com for IC boundary node validation.",
  "frontend/src/App.tsx": "Root React component wiring theme provider, layout, and all major sections including header, hero, products, about, contact, documents, and footer.",
  "frontend/src/catalog/staticProducts.ts": "Static product catalog with metadata and image URLs plus helper for looking up products by name.",
  "frontend/src/components/About.tsx": "About section with company intro, storefront image, descriptive text, and a grid of core value cards.",
  "frontend/src/components/Contact.tsx": "Contact section providing a message form with backend submission and cards for phone, email, address, business hours, and Facebook link.",
  "frontend/src/components/Documents.tsx": "Displays a list of documents with loading states, date formatting, and options to view or download each file.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with company info, quick navigation links, contact details, and social media icons.",
  "frontend/src/components/Header.tsx": "Provides a responsive header with scroll-based styling, deep-link handling, and navigation that smoothly scrolls to page sections.",
  "frontend/src/components/Hero.tsx": "Implements the homepage hero section with a background banner, marketing text, feature highlights, and buttons that scroll to other sections.",
  "frontend/src/components/Products.tsx": "Fetches and displays products grouped by category, showing category icons, product cards, images, and pricing with loading states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, storing identity state, and exposing login and logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for documents, contact submissions, and products, including enrichment of product data with static catalog info.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme CSS variables for light and dark modes, plus utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind with theme extensions, color variables, plugins, and custom animations.",
  "project_state.json": "Stores project metadata including feature requirements, architectural notes, and current state version."
}