{
  "backend/main.mo": "Main backend actor implementing product catalog, contact submissions, document management, payment orders with Stripe integration, user profiles, and access control with admin/user permissions.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including admin panel for product management, Stripe payment integration, order tracking system, and modern UI design with associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including routing, product display, contact forms, checkout, order history, admin panel, and static content pages with DQM Computer branding.",
  "frontend/DOMAIN_CONNECTION_INSTRUCTIONS.md": "Step-by-step guide for connecting the custom domain dqmcomputer.com to the Internet Computer application with DNS configuration instructions and troubleshooting tips.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining warm earth tones (terracotta primary, sand secondary) for light and dark modes with sidebar and chart color variables.",
  "frontend/index.html": "HTML entry point with canonical link to https://dqmcomputer.com and title 'DQM Computer - Quality Technology Solutions'.",
  "frontend/public/.well-known/ic-domains": "Internet Computer domain verification file containing dqmcomputer.com for custom domain connection.",
  "frontend/src/App.tsx": "Main React application with QueryClient, ThemeProvider, and TanStack Router defining routes for home, checkout, orders, payment success/failure, and admin pages with ProfileSetupModal and StripeSetup.",
  "frontend/src/catalog/staticProducts.ts": "Static product catalog defining four products (HP Laptop 15, Dell Inspiron Desktop, Canon Laser Printer, TP-Link WiFi Router) with English descriptions, categories, availability, prices, and image URLs.",
  "frontend/src/components/About.tsx": "React component displaying the About section with company information, two-column layouts featuring images and text describing P C COMPUTER AND COMMUNICATION's services and expertise.",
  "frontend/src/components/AdminPanel.tsx": "Admin dashboard component for managing products with CRUD operations, form dialogs for adding/editing products, image upload support, and integration with React Query for data fetching and mutations.",
  "frontend/src/components/CancellationRefundPolicy.tsx": "Empty component file for displaying cancellation and refund policy content.",
  "frontend/src/components/Cart.tsx": "Shopping cart sidebar component using Sheet UI, displays cart items with quantity controls, remove functionality, price formatting in INR, and checkout navigation.",
  "frontend/src/components/CartButton.tsx": "Button component with shopping cart icon and badge showing item count, toggles the Cart sheet when clicked.",
  "frontend/src/components/Checkout.tsx": "Checkout page component with shipping form, order summary, authentication check, and Stripe payment integration that redirects to Stripe checkout session.",
  "frontend/src/components/Contact.tsx": "Contact section component with a form for submitting messages, displays contact information cards (phone, email, location, hours), and integrates with backend contact form submission.",
  "frontend/src/components/Documents.tsx": "Empty component file intended for displaying document-related content.",
  "frontend/src/components/Footer.tsx": "Footer component displaying company branding, quick navigation links with smooth scrolling, contact information, and social media links. Includes copyright notice and a 'Made with Heart' message.",
  "frontend/src/components/Header.tsx": "Fixed header navigation component with logo, section scroll links, mobile menu toggle, cart button, and login button. Conditionally displays 'My Orders' and 'Admin' links based on authentication and admin status.",
  "frontend/src/components/Hero.tsx": "Hero section component with full-screen background image, company title, tagline, and call-to-action buttons for shopping and contact. Includes smooth scrolling to other page sections.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component using Internet Identity that toggles between login and logout states. Handles authentication flow and clears query cache on logout.",
  "frontend/src/components/OrderHistory.tsx": "Order history page component displaying user's past orders with status badges, order details, items, and formatted prices. Shows login prompt for unauthenticated users.",
  "frontend/src/components/PaymentFailure.tsx": "Payment failure page component displaying an error message with an XCircle icon and a button to return to the shop. Informs users no charges were made.",
  "frontend/src/components/PaymentSuccess.tsx": "Payment success page component that clears the cart on mount, displays a success message with CheckCircle icon, and provides a button to continue shopping.",
  "frontend/src/components/Products.tsx": "Products catalog component that fetches and displays products grouped by category with icons, images, prices, and 'Add to Cart' buttons. Handles image fallbacks and price formatting in INR.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal component that prompts authenticated users without a profile to enter their name (required), email, and phone (optional) before continuing to use the application.",
  "frontend/src/components/Services.tsx": "Displays a grid of six service offerings (computer sales, repair, networking, data recovery, laptop services, printer solutions) with icons and descriptions in card components.",
  "frontend/src/components/StripeSetup.tsx": "Admin-only modal that appears when Stripe is not configured, allowing admins to enter their Stripe secret key and configure payment processing for India.",
  "frontend/src/components/Terms.tsx": "Empty component file with no content.",
  "frontend/src/components/WhyChooseUs.tsx": "Marketing section displaying four key value propositions (quality products, trusted service, fast delivery, expert support) in a card grid layout.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling authentication state changes and initializing access control with an optional admin token from URL parameters.",
  "frontend/src/hooks/useCart.ts": "Custom hook managing shopping cart state in localStorage, providing functions to add/remove items, update quantities, calculate totals, and convert cart items to ShoppingItem format for checkout.",
  "frontend/src/hooks/useCreateCheckoutSession.ts": "React Query mutation hook that calls the backend actor to create a Stripe checkout session with cart items and success/cancel URLs, returning the session ID and redirect URL.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for fetching and mutating data including documents, contact submissions, products (with static catalog enrichment), product categories, and payment orders using the actor from useActor.",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks for fetching and saving the current user's profile using the actor, with query invalidation on successful mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm earth-toned color palette (terracotta and sand) for both light and dark modes using oklch color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and wraps the App component with InternetIdentityProvider and QueryClientProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities for sensitive parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom color variables (terracotta and sand palettes), container settings, border radius variables, custom animations, and typography plugin.",
  "project_state.json": "Project state tracking document defining a computer e-commerce platform with Internet Identity authentication, admin panel, shopping cart, Stripe payments, and order tracking features with their implementation status."
}