{
  "backend/main.mo": "Motoko canister implementing product, contact submission, and document storage with query and update APIs using maps and blob storage mixin.",
  "feature_evidence.json": "Empty feature evidence report JSON with no listed features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for all frontend source files and assets.",
  "frontend/DOMAIN_CONNECTION_INSTRUCTIONS.md": "Markdown guide explaining how to configure the custom domain pccomputerandcommunication.com for the IC app.",
  "frontend/index.css": "Tailwind-based global stylesheet defining light and dark theme color variables and base styles.",
  "frontend/index.html": "HTML entry file setting up the root element, canonical domain link, and loading the main React script.",
  "frontend/public/.well-known/ic-domains": "Domain verification file listing pccomputerandcommunication.com for IC boundary nodes.",
  "frontend/src/App.tsx": "Main React component composing all sections of the site with theme and query providers.",
  "frontend/src/catalog/staticProducts.ts": "Static product catalog with metadata and image URLs plus helper lookup function.",
  "frontend/src/components/About.tsx": "About section displaying company intro, storefront image, and core values.",
  "frontend/src/components/CancellationRefundPolicy.tsx": "Component rendering the site's cancellation and refund policy section.",
  "frontend/src/components/Contact.tsx": "Implements a contact section with a form that submits user messages via a mutation and displays contact details. Includes validation, toast notifications, and UI cards.",
  "frontend/src/components/Documents.tsx": "Fetches and displays downloadable documents using cards, with loading skeletons and formatted upload dates. Provides view and download actions for each document.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, quick navigation links, contact info, and social icons. Includes smooth scroll handling for section navigation.",
  "frontend/src/components/Header.tsx": "Creates a sticky header with navigation links, scroll-based styling, mobile sheet menu, and support for deep-link hash navigation. Allows smooth scrolling to page sections.",
  "frontend/src/components/Hero.tsx": "Displays the homepage hero banner with headline, CTAs, and feature highlights. Supports smooth scrolling to products and contact sections.",
  "frontend/src/components/Products.tsx": "Displays available products grouped by category, fetching data via react-query and showing images, prices, and details.",
  "frontend/src/components/Terms.tsx": "Renders the site's Terms & Conditions page with sections for overview, pricing, orders, returns, and warranty.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating related queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, stored identity restoration, and state tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for fetching and mutating documents, contact submissions, and products using the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind base styles and theme variables for light/dark mode, including color tokens and utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering the main App component.",
  "frontend/tailwind.config.js": "TailwindCSS configuration enabling dark mode, custom color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current state, including feature history, requirements, architectural notes, and known issues for the business website and store."
}