{
  "backend/main.mo": "Main Motoko actor implementing product catalog, shopping cart, Stripe payment integration, order management, user profiles, contact submissions, document storage, and role-based access control with admin/user permissions.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including Internet Identity authentication, product catalog, shopping cart, Stripe checkout, order history, admin dashboard, and contact form with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including React components, hooks, routing, styling, static catalog, domain configuration, and business information for P C COMPUTER AND COMMUNICATION (dqmcomputer.com).",
  "frontend/DOMAIN_CONNECTION_INSTRUCTIONS.md": "Step-by-step guide for connecting the custom domain dqmcomputer.com to the Internet Computer application via DNS CNAME/A records pointing to icp1.io and IC boundary nodes.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining warm earth tones (terracotta primary, sand secondary) for light and dark mode themes.",
  "frontend/index.html": "HTML entry point with canonical URL pointing to https://dqmcomputer.com and page title 'DQM Computer - Quality Technology Solutions'.",
  "frontend/public/.well-known/ic-domains": "Internet Computer domain verification file containing 'dqmcomputer.com' for custom domain boundary node routing.",
  "frontend/src/App.tsx": "Root React component with QueryClient, ThemeProvider, path-based routing for home/checkout/orders/payment pages, and ProfileSetupModal and StripeSetup initialization.",
  "frontend/src/catalog/staticProducts.ts": "Static product catalog defining four products (HP Laptop, Dell Desktop, Canon Printer, TP-Link Router) with English descriptions, categories, availability, and local image URLs.",
  "frontend/src/components/About.tsx": "Displays the About section with company information, two-column layouts featuring images and text describing P C COMPUTER AND COMMUNICATION's technology solutions and expert service offerings.",
  "frontend/src/components/CancellationRefundPolicy.tsx": "Empty file with no content.",
  "frontend/src/components/Cart.tsx": "Shopping cart side sheet component that displays cart items with quantity controls, remove buttons, price formatting, and checkout functionality using the useCart hook.",
  "frontend/src/components/CartButton.tsx": "Button component with shopping cart icon and badge showing item count, opens the Cart sheet when clicked.",
  "frontend/src/components/Checkout.tsx": "Checkout page component with shipping form, order summary, and Stripe payment integration that validates user authentication and form data before creating a checkout session.",
  "frontend/src/components/Contact.tsx": "Contact section with a form for submitting messages and contact information cards displaying phone, email, address, hours, and Facebook link with map embed.",
  "frontend/src/components/Documents.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Footer component with company branding, quick navigation links, contact information, legal links, social media, and copyright notice with smooth scrolling functionality.",
  "frontend/src/components/Header.tsx": "Navigation header component with responsive menu, scroll effects, authentication status, cart button, and smooth scrolling to page sections. Handles routing between home and orders pages with deep-link hash navigation support.",
  "frontend/src/components/Hero.tsx": "Landing hero section with background image, company branding, call-to-action buttons for shopping and contact. Implements smooth scrolling to other page sections.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that toggles between login and logout states using Internet Identity. Clears query cache on logout and handles loading states.",
  "frontend/src/components/OrderHistory.tsx": "Displays authenticated user's order history with order details, status badges, formatted dates and prices. Shows login prompt for unauthenticated users.",
  "frontend/src/components/PaymentFailure.tsx": "Payment cancellation/failure page with error message and button to return to shop. Informs users no charges were made.",
  "frontend/src/components/PaymentSuccess.tsx": "Payment success confirmation page that clears the cart and displays success message with option to continue shopping.",
  "frontend/src/components/Products.tsx": "Product catalog component that fetches and displays products grouped by category with images, prices, and add-to-cart functionality. Formats prices in INR and handles product images from multiple sources.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time authenticated users to set up their profile with required name and optional email/phone fields. Prevents dismissal until profile is created.",
  "frontend/src/components/Services.tsx": "React component that displays a grid of six service cards (Computer Sales, Repair & Maintenance, Networking, Data Recovery, Laptop Services, Printer Solutions) with icons and descriptions.",
  "frontend/src/components/StripeSetup.tsx": "Admin-only modal dialog component that prompts for Stripe secret key configuration when Stripe is not yet set up, with form validation and loading states.",
  "frontend/src/components/Terms.tsx": "Empty component file with no content.",
  "frontend/src/components/WhyChooseUs.tsx": "React component that displays four feature cards (Quality Products, Trusted Service, Fast Delivery, Expert Support) highlighting the business's value propositions.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance with authentication, automatically recreating it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useCart.ts": "Custom React hook that manages shopping cart state in localStorage, providing functions to add/remove items, update quantities, calculate totals, and convert to ShoppingItem format.",
  "frontend/src/hooks/useCreateCheckoutSession.ts": "Custom React hook using TanStack Query mutation to create Stripe checkout sessions via the backend actor, returning session ID and redirect URL.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and context provider for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of custom React Query hooks for fetching and mutating backend data including documents, contact submissions, products by category/availability, and payment orders.",
  "frontend/src/hooks/useUserProfile.ts": "Custom React Query hooks for fetching and saving the current user's profile, with automatic cache invalidation on successful updates.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm earth-toned color palette (terracotta and sand) for both light and dark modes using OKLCH color space.",
  "frontend/src/main.tsx": "React application entry point that sets up the root component with QueryClient for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom terracotta and sand color palettes, container settings, animations, and typography plugin support.",
  "project_state.json": "Project metadata defining a full-stack e-commerce platform for computer products with Internet Identity authentication, Stripe payments, shopping cart, checkout, and order tracking features."
}