{
  "backend/main.mo": "Motoko backend actor managing products, documents, user profiles, Stripe payments, access control, and contact submissions.",
  "feature_evidence.json": "Empty feature evidence report structure with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all frontend components and files for reference.",
  "frontend/DOMAIN_CONNECTION_INSTRUCTIONS.md": "Guide for configuring DNS records and verifying the custom domain dqmcomputer.com for the IC app.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point defining root container and linking to main TypeScript bundle.",
  "frontend/public/.well-known/ic-domains": "Lists dqmcomputer.com for IC domain verification.",
  "frontend/src/App.tsx": "Main React app rendering payment status pages or main site sections with theme and query providers.",
  "frontend/src/catalog/staticProducts.ts": "Defines static product metadata with descriptions, categories, and image URLs plus a lookup helper.",
  "frontend/src/components/About.tsx": "About section showing company intro, images, and service descriptions in a two‑section layout.",
  "frontend/src/components/CancellationRefundPolicy.tsx": "Empty component file with no implemented content.",
  "frontend/src/components/Contact.tsx": "Contact form component with validation, async submission, and toast notifications.",
  "frontend/src/components/Documents.tsx": "Empty placeholder component file.",
  "frontend/src/components/Footer.tsx": "Footer with company info, quick links, contact details, and smooth scroll navigation.",
  "frontend/src/components/Header.tsx": "Sticky header with logo, nav links, mobile sheet menu, and smooth scroll handling.",
  "frontend/src/components/Hero.tsx": "Hero section with background image, tagline, and buttons that scroll to products or contact.",
  "frontend/src/components/PaymentFailure.tsx": "Displays payment failure message with option to return to home page.",
  "frontend/src/components/PaymentSuccess.tsx": "Displays payment success confirmation with button to continue shopping.",
  "frontend/src/components/Products.tsx": "Fetches and displays products by category with checkout handling and loading states.",
  "frontend/src/components/Services.tsx": "Renders a services section showing a grid of service cards with icons, titles, and descriptions.",
  "frontend/src/components/Terms.tsx": "Empty file with no implemented component.",
  "frontend/src/components/WhyChooseUs.tsx": "Displays a feature grid explaining reasons to choose the company, each with an icon, title, and description.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useCreateCheckoutSession.ts": "Provides a mutation to create Stripe checkout sessions through the backend actor and parse the returned session JSON.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook to manage identity state, login flow, and stored sessions.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching documents, products, contact submissions, and submitting forms using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode values, and utility layers.",
  "frontend/src/main.tsx": "Application entry point initializing React Query and Internet Identity providers before rendering App.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins like typography, container queries, and animate.",
  "project_state.json": "Stores the project’s metadata and pending feature requests, including two items for adding a Facebook profile link to the footer."
}