{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "PC Computer Platform - Frontend Implementation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Implement Internet Identity authentication UI with login/logout flow",
      "acceptanceCriteria": [
        "Users can log in using Internet Identity",
        "Users can log out and session is cleared",
        "Authentication state persists across page refreshes",
        "Unauthenticated users are prompted to log in for protected features"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LoginButton.tsx",
          "operation": "modify",
          "description": "Verify the LoginButton component properly handles Internet Identity login/logout flow with loading states and query cache clearing on logout. Use the authorization component's authentication requirements."
        },
        {
          "path": "frontend/src/hooks/useInternetIdentity.ts",
          "operation": "modify",
          "description": "Ensure the Internet Identity hook manages authentication state, identity persistence, and delegation validation correctly with proper error handling."
        },
        {
          "path": "frontend/src/components/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Verify the ProfileSetupModal prompts authenticated users without profiles to set up their name and optional contact information, preventing dismissal until completed. Use the authorization component to check for existing profiles."
        },
        {
          "path": "frontend/src/hooks/useUserProfile.ts",
          "operation": "modify",
          "description": "Ensure profile hooks properly fetch and save user profiles with correct loading states to prevent modal flashing. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Create admin panel UI for product management with add/edit/delete capabilities",
      "acceptanceCriteria": [
        "Admin users can access a dedicated admin panel",
        "Admins can create new products with all required fields",
        "Admins can edit existing product information",
        "Admins can delete products from the catalog",
        "Product changes are immediately reflected in the customer-facing catalog"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminPanel.tsx",
          "operation": "create",
          "description": "Create an admin panel component that displays only for admin users. Include product management interface with forms for adding/editing products (name, description, price, category, image upload using blob-storage component). Display existing products in a table/grid with edit and delete actions. Verify the blob-storage component's usage instructions before implementing image uploads."
        },
        {
          "path": "frontend/src/hooks/useProductMutations.ts",
          "operation": "create",
          "description": "Create custom React Query hooks for product mutations including addProduct, updateProduct, and deleteProduct. Handle ExternalBlob image uploads and invalidate product queries on successful mutations."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route for /admin path that renders the AdminPanel component. Ensure the route is protected and only accessible to admin users."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Add Admin link in the navigation menu that is only visible to authenticated admin users. Link should navigate to /admin route."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Build shopping cart UI with add/remove/quantity management and total calculation",
      "acceptanceCriteria": [
        "Users can add products to cart from the product catalog",
        "Users can increase or decrease item quantities in the cart",
        "Users can remove items from the cart",
        "Cart displays subtotal and total price",
        "Cart state persists during the session"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Cart.tsx",
          "operation": "modify",
          "description": "Verify the Cart component displays all cart items with quantity controls (increase/decrease), remove buttons, and calculates subtotal and total price. Ensure prices are formatted in INR (₹)."
        },
        {
          "path": "frontend/src/components/CartButton.tsx",
          "operation": "modify",
          "description": "Verify the CartButton displays a shopping cart icon with a badge showing the current item count and opens the Cart sheet when clicked."
        },
        {
          "path": "frontend/src/hooks/useCart.ts",
          "operation": "modify",
          "description": "Ensure the cart hook manages state in localStorage with functions to add items, remove items, update quantities, clear cart, and calculate totals. Verify cart state persists across sessions."
        },
        {
          "path": "frontend/src/components/Products.tsx",
          "operation": "modify",
          "description": "Ensure each product card includes an 'Add to Cart' button that calls the useCart hook's addItem function. Display visual feedback when items are added."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Implement checkout UI flow with shipping form and contact information display",
      "acceptanceCriteria": [
        "Checkout page collects shipping address and contact information",
        "Contact details 9315906829 and panerudaya11@gmail.com are displayed on the contact section",
        "Users cannot proceed to payment without completing required fields",
        "Order summary shows items, quantities, and total price before payment"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Checkout.tsx",
          "operation": "modify",
          "description": "Verify the Checkout component displays shipping address form (full name, email, phone, billing address) with validation, order summary with cart items and total price in INR, and payment button that triggers Stripe checkout. Ensure required field validation prevents proceeding without completing all fields."
        },
        {
          "path": "frontend/src/components/Contact.tsx",
          "operation": "modify",
          "description": "Ensure the Contact section displays the required contact details: phone number 9315906829 and email panerudaya11@gmail.com. Include these in contact information cards along with the contact form."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Verify the Footer displays contact information including phone 9315906829 and email panerudaya11@gmail.com in the contact details section."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Integrate Stripe payment UI with checkout session creation and redirects",
      "acceptanceCriteria": [
        "Stripe checkout session is created when user proceeds to payment",
        "Users are redirected to Stripe payment page",
        "Successful payments redirect to success page",
        "Failed or cancelled payments redirect to failure page",
        "Test mode allows demonstration without real payments"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/StripeSetup.tsx",
          "operation": "modify",
          "description": "Verify the StripeSetup modal prompts admin users to configure Stripe with secret key and allowed countries when Stripe is not yet configured. Use the stripe component's configuration requirements. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useCreateCheckoutSession.ts",
          "operation": "modify",
          "description": "Ensure the checkout session hook creates a Stripe session with shopping items, success URL (/payment-success), and cancel URL (/payment-failure). Parse the JSON response, validate the session URL exists, and return the session object. Verify the stripe component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/Checkout.tsx",
          "operation": "modify",
          "description": "Add Stripe checkout session creation on payment button click. Use useCreateCheckoutSession hook, validate the returned session URL, and redirect to the Stripe URL using window.location.href (not router navigation). Handle loading and error states appropriately."
        },
        {
          "path": "frontend/src/components/PaymentSuccess.tsx",
          "operation": "modify",
          "description": "Verify the PaymentSuccess component clears the cart, displays a success message, and provides a button to continue shopping. This page is reached after successful Stripe payment."
        },
        {
          "path": "frontend/src/components/PaymentFailure.tsx",
          "operation": "modify",
          "description": "Verify the PaymentFailure component displays an error message explaining the payment was cancelled or failed, informs users no charges were made, and provides a button to return to shop."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify routes exist for /payment-success and /payment-failure paths that render PaymentSuccess and PaymentFailure components respectively. Ensure StripeSetup modal is initialized in the app root."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Create order tracking UI displaying order history with status badges",
      "acceptanceCriteria": [
        "Users can view their order history after authentication",
        "Each order shows status badge with current state",
        "Orders display with order ID, date, items, and total price",
        "Status progresses through Pending → Processing → Shipped → Delivered",
        "Only authenticated users can access order history"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/OrderHistory.tsx",
          "operation": "modify",
          "description": "Verify the OrderHistory component fetches and displays user orders with authentication guard. Show login prompt for unauthenticated users. Display each order with ID, date (formatted), items list, total price in INR, and status badge. Map backend OrderStatus (pending/completed/failed) to display statuses (Pending/Processing/Shipped/Delivered)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the useGetMyOrders hook fetches the authenticated user's order history from the backend and handles loading/error states correctly."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify the /orders route exists and renders the OrderHistory component. Ensure the route is accessible from the navigation."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Display product catalog UI with category grouping and product details",
      "acceptanceCriteria": [
        "Products are displayed in a grid layout",
        "Products are grouped by category (laptops, desktops, accessories, etc.)",
        "Each product shows image, name, description, and price",
        "Prices are formatted in Indian Rupees (₹)",
        "Users can browse all available products"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Products.tsx",
          "operation": "modify",
          "description": "Verify the Products component fetches available products, groups them by category, and displays them in a responsive grid layout. Each product card should show image (using ExternalBlob or imageUrl), name, description, price formatted in INR (₹), and an 'Add to Cart' button. Handle both blob-storage images and URL-based images. Verify the blob-storage component's usage instructions before implementing image display."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the useGetAllAvailableProducts hook fetches only available products from the backend for the customer-facing catalog. Verify proper loading and error state handling."
        },
        {
          "path": "frontend/src/components/Hero.tsx",
          "operation": "modify",
          "description": "Verify the Hero section includes a call-to-action button that scrolls to the Products section or navigates to the product catalog."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Apply modern, professional design theme with tech retail color scheme",
      "acceptanceCriteria": [
        "Design uses a professional color palette suitable for tech retail",
        "Typography is clean and readable across all components",
        "Spacing and layout are consistent throughout the application",
        "Design works well on both light and dark modes",
        "Visual hierarchy clearly guides users through shopping flow"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Verify the global styles use the custom terracotta and sand color palette defined in CSS variables. Ensure the color scheme is professional and suitable for tech retail. Verify both light and dark mode color definitions work correctly."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Verify the Tailwind configuration extends the theme with terracotta and sand color palettes, container settings, and typography plugin. Ensure the configuration supports both light and dark modes."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Verify the Header uses consistent spacing, typography, and the terracotta/sand color scheme. Ensure responsive design works on mobile and desktop with clean navigation layout."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Verify the Footer maintains consistent design with the Header using the same color scheme and spacing standards. Ensure typography is readable and layout is well-organized."
        },
        {
          "path": "frontend/src/components/Products.tsx",
          "operation": "modify",
          "description": "Verify product cards use consistent spacing, shadows, and the terracotta color scheme for buttons and accents. Ensure grid layout is responsive and visually balanced."
        },
        {
          "path": "frontend/src/components/Cart.tsx",
          "operation": "modify",
          "description": "Verify the Cart sheet uses consistent design patterns with proper spacing, typography, and color scheme. Ensure the layout clearly presents cart items and totals."
        },
        {
          "path": "frontend/src/components/Checkout.tsx",
          "operation": "modify",
          "description": "Verify the Checkout page uses a clean layout with clear visual hierarchy guiding users through the form fields to payment. Apply consistent spacing and typography."
        }
      ]
    }
  ]
}